{
mainMenu: [
   {name: "portfolio", background: "../images/portfolio_background.jpg"},
   {name: "about", background : "../images/about_background.jpg"},
   {name: "contact", background : "../images/contact_background.jpg"},
   {name: "blog", background : "../images/blog_background.jpg"}
  ],
  filters: [
    {name: "All", type: ""},
    {name: "Print", type: "Print"},
    {name: "Web", type: "Web"},
    {name: "Social", type: "Social"},
    {name: "Photo", type: "Photo"},
    {name: "Brand", type: "Brand"},
    {name: "3D", type: "3D"},
    {name: "Illustration", type: "Illustration"},
    {name: "Retouch", type: "Retouch"}
  ],
  projects: [
    {name: "Free Coffee Campaign", type:"Print", image : "../images/portfolioitem.jpg", description: "I had the pleasure of designing the visual look and feel of a poster advertising freebees and informing passerby of the Wyoming Union finals week schedule. I decided to create a combined neo-retro, typographic and icon grid with a neon color scheme to attract attention in a manner different from other posters that would be on the billboards at the time.", modalImages: [{name: "image1", image: "../images/free-coffee.jpg"}, {name: "image2", image: "../images/goodluckfacebookcover2.jpg"}, {name: "image3", image: "../images/goodluckfacebookprofile.jpg"}, {name: "image4", image: "../images/unionscheduledigitalsign.jpg"} ]},
    {name: "Campus Map Project", type:"3D", image : "../images/portfolio_page/bench_square.jpg", description: "As a 3D modeling intern for the School of Energy Resources at the University of Wyoming, I was tasked with creating virtual representations of buildings and objects on campus. Models were created in MODO and were then placed into the Unity game development engine, from which we were able to export application files compatible with the Cave Automatic Virtual Environment.", modalImages: [{name: "image1", image: "../images/cave.jpg"}, {name: "image2", image: "../images/cave-network.jpg"}, {name: "image3", image: "../images/tables.jpg"}, {name: "image4", image: "../images/campusmodel.jpg"}, {name: "image5", image: "../images/table.png"} ]},
    {name: "Pack Softball Camp", type:"Web", image : "../images/portfolio_page/pack_softball_square.jpg", description: "During my tenure as a web design intern for SDI Camps and Races, I was given the opportunity to design a website for Pack Softball Camps at NC State University. Design limitations included using the NC State color scheme, including the Pack Softball team photographs and Twitter Feed, and creating the site within SDI's PHP cart and Foundation framework. Using the Foundation grid I incorporated responsive resizing for all screen sizes.", modalImages: [{name: "image1", image: "../images/pack-softball.jpg"}, {name: "image2", image: "../images/pack-comp.jpg"}, {name: "image3", image: "../images/pack-phone.jpg"} ]},
    {name: "Saga Typeface", type:"Print", image : "../images/portfolio_page/typeface_square.jpg", description: "As an undergraduate student at the University of Wyoming, I was given the assignment to design a custom typeface based on a variation I created of an existing letterform. I then printed the result for the final critique. The Saga typeface was created basesd off of serif typefaces on the covers of modern Fantasy media.", modalImages: [{name: "image1", image: "../images/typeface.jpg"} ]},
    {name: "SDI Proto Sites", type:"Web", image : "../images/portfolio_page/proto_square.jpg", description: "I was tasked with creating proto and test sites with new design options and ideas as an intern at SDI Camps and Races. All sites were required to be made responsive using the Foundation framework.", modalImages: [{name: "image1", image: "../images/proto.jpg"}, {name: "image2", image: "../images/test2.jpg"}, {name: "image3", image: "../images/test3.jpg"} ]},
    {name: "Jiko Miru", type:"Illustration", image : "../images/portfolio_page/jiko_miru_square.jpg", description: "As an honors student at the University of Wyoming, I took a Cultural Identity course in which we were able to develop a personal creative project. I chose to create a book that explored Japanese culture from an American context based on my previous study abroad experiences in the area. I incorporated a custom logo design, conceptual illustrations, and writing on various topics.", modalImages: [{name: "image1", image: "../images/jiko-miru_cover.jpg"}, {name: "image2", image: "../images/jiko-miru.jpg"} ]},
    {name: "Richmond American Photo Retouching", type:"Retouch", image : "../images/portfolio_page/mdc_retouch_square.jpg", description: "One of my tasks as a contractor for MDC was retouching product photos to be used in print and web media. Using Photoshop, I increased contrast and vibrance and removed any distracting visuals from the photographs, such as stray tree branches or furniture on the edges of the photo and deep shadows. One of these images was featured in a Richmond American slideshow, which can be seen here: https://www.youtube.com/watch?v=iAiz-oNBwvc.", modalImages: [{name: "image1", image: "../images/hemingway_livingroom.jpg"} ]},
    {name: "PR for Techies", type:"Brand", image : "../images/portfolio_page/prfortechies_square.jpg", description: "As a contract digital marketing specialist for Metzger Albee Public Relations, I had the pleasure of contibuting to the visual feel of the PR for Techies meetup event campaign. I created a logo based off of the Metzger Albee brand and color scheme, and contributed to the overall visual layout and imagery of web pages; slideshows; and social media posts, cover photos, and profile pictures.", modalImages: [{name: "image1", image: "../images/prfortechies_logo.jpg"}, {name: "image2", image: "../images/thrive_slide.jpg"}, {name: "image3", image: "../images/prfortechies_landing.jpg"} ]},
    {name: "MDC Pinterest Pins", type:"Social", image : "../images/portfolio_page/six_expert_square.jpg", description: "As a contractor at MDC holdings, I contributed designs to Richmond American's Pinterest board to advertise their blog offerings. I was given a title which I was required include in the design, and I collaborated with the design team to come up with the most appropriate solution for the board style.", modalImages: [{name: "image1", image: "../images/six-expert-movingtips.jpg"}, {name: "image2", image: "../images/petpin.jpg"}, {name: "image3", image: "../images/protips.jpg"}, {name: "image4", image: "../images/homestage.jpg"} ]},
    {name: "Mothers Day Illustration", type:"Illustration", image : "../images/portfolio_page/mothersday_square.jpg", description: "Last year, I created a quick Mothers Day gift for my mom, which was inspired by the recently popular DIY lettering movement. I drew a mockup on graph paper, then recreated it on water color paper using ink pens and watercolor paints.", modalImages: [{name: "image1", image: "../images/mothersday-illustration.jpg"} ]},
    {name: "Senior Photos", type:"Photo", image : "../images/portfolio_page/ryansenior_square.jpg", description: "I had the chance to take and retouch senior photographs for my younger brother last fall using my Nikon DSLR.", modalImages: [{name: "image1", image: "../images/ryancool.jpg"}, {name: "image2", image: "../images/ryansmile.jpg"} ]},
    {name: "Metzger Albee Email Templates", type:"Web", image : "../images/portfolio_page/email_templates_square.jpg", description: "One of my tasks as a digital marketing specialist at Metzger Albee was to produce email templates for various clients. Depending on the client's preferences, I was required to use MailChimp or Vertical Response Classic in conjunction with code editing.", modalImages: [{name: "image1", image: "../images/wwrenyolds.jpg"}]},
    {name: "Brain-mazing Race", type:"Print", image : "../images/portfolio_page/brainrace_square.jpg", description: "I designed the Brain-mazing Race poster as a student employee at the Wyoming Union. I was required to include some kind of harzard symbol and a zombie image, so I chose to illustrate a stylized zombie in Photoshop. I also based the title off of the original Amazing Race logo but gave it a zombie-like flair in Photoshop.", modalImages: [{name: "image1", image: "../images/brainrace.jpg"}]},
    {name: "Richmond American Blog Post", type:"Web", image : "../images/portfolio_page/richmondblog_square.jpg", description: "I am an occassional design contributor to the Richmond American blog. The task includes importing photos and giving them captions, as well as formatting the copy in HTML using the WordPress CMS.", modalImages: [{name: "image1", image: "../images/richmondblog.jpg"}]},
    {name: "Hand-drawn Birthday Cards", type:"Illustration", image : "../images/portfolio_page/realadult_square.jpg", description: "Every so often I draw out typographic birthday cards for friends and family. It's a fun opportunity to create something unique for loved ones and practice with different kinds of letterforms and custom phrases.", modalImages: [{name: "image1", image: "../images/realadult.jpg"}]},
    {name: "Cowboy Check-in", type:"Brand", image : "../images/portfolio_page/cowboy_square.jpg", description: "As a student designer for the Wyoming Union, I was tasked with coming up with designs for the Campus Activity Center's new Cowboy Check-in program, in which students could swipe their IDs at various events for a chance to be drawn to win a prize. The team wanted a logo that emphasized location in a modern way and utilized a cowboy boot to run with the school's mascot. I collaborated with my manager to come up with basic design ideas, created the final design and designed extra marketing materials to advertise the new project to students.", modalImages: [{name: "image1", image: "../images/cowboy.jpg"}, {name: "image2", image: "../images/cowboycheckinbubble2.png"} ]},
    {name: "Richmond American Interactive Floorplans", type:"Web", image : "../images/portfolio_page/floorplan_square.jpg", description: "Part of my production work at Richmond American include creating interactive floorplans for display on their various community pages. I lay the plan out in Adobe Illustrator, save the file as an SVG, retag the different options so they are recognized by the CMS, and upload the files for review.", modalImages: [{name: "image1", image: "../images/floorplan.jpg"}]},
    {name: "3D Poster Illustrations", type:"3D", image : "../images/portfolio_page/nara_square.jpg", description: "As a senior at the University of Wyoming, I created posters for my design course that incorporated 2D type and illustration with 3D shapes created in MODO. Each poster was representative of a place I visited while studying abroad in Japan.", modalImages: [{name: "image1", image: "../images/nara.jpg"}]},
    {name: "Pixel Life", type:"Illustration", image : "../images/portfolio_page/pixel_square.jpg", description: "An illustration I created in high school of natural phenomena in a fragmented context, indicative of both ancient Roman murals and modern pixelization, and ultimately evocative of humans' inherent categorization of the natural world.", modalImages: [{name: "image1", image: "../images/pixel.jpg"}]},
    {name: "Game Night", type:"Print", image : "../images/portfolio_page/gamenight_square.jpg", description: "I created this poster for the annual Game Night event at the Wyoming Union. One of the popular activities at the event is competing in video game competitions, so I created the design to resemble retro game graphics.", modalImages: [{name: "image1", image: "../images/gamenight.jpg"}]},
    {name: "International Night", type:"Print", image : "../images/portfolio_page/internight_square.jpg", description: "I created this poster for the annual International Night event at the Wyoming Union. I was required to include the country flags of over 30 different countries while not overemphasizing any particular flag, so I set them as a faded grid background and emphasized the globe imagery to maintain an egalitarian appearance. The font was kept simple and in an international modern style to also help maintain neutral imagery.", modalImages: [{name: "image1", image: "../images/internight.jpg"}]},
    {name: "MDC Touchscreen Maps", type:"Web", image : "../images/portfolio_page/map_square.jpg", description: "I assisted in creating Richmond American maps that can be interacted with on a touchscreen in each home sales center. We used SVG technology and Adobe Illustrator to create these maps.", modalImages: [{name: "image1", image: "../images/map.jpg"}]},
    {name: "Frisbee Golf", type:"Print", image : "../images/portfolio_page/frisbee_square.jpg", description: "The Wyoming Union hosted a Frisbee Golf event on the campus green areas. I had the pleasure of creating a poster for this event, and wanted to show simplified movement and action to symbolize the nature of the game and interest students who enjoy sports.", modalImages: [{name: "image1", image: "../images/frisbee.jpg"}]},
    {name: "Googala", type:"Print", image : "../images/portfolio_page/googala_square.jpg", description: "An African-inspired cultural event was hosted on the University of Wyoming campus, and I was tasked with creating a poster that embraced the visual aspects of the culture while featuring acrobatic imagery to emphasize the main performance. I drew the background and font to emulate traditional tribal imagery, and created a matching hand-drawn acrobat for the foreground. These drawings were then imported and vectorized in Adobe Illustrator and stylized with new colors and filters.", modalImages: [{name: "image1", image: "../images/googala-vertical.jpg"}]},
    {name: "Alternative Winter Break in Ghana", type:"Print", image : "../images/portfolio_page/ghana_square.jpg", description: "The Wyoming Union Service, Leadership, and Community engagement office planned to host a service trip to Ghana that students and staff could attend. I was given the opportunity to create poster to advertise this event, and I created the poster using Ghana's national flag colors and created a patterned background out of a traditional writing symbol of the region. Distressed texture was applied to the piece in Photoshop, and the disparate elements were then imported into Adobe Illustrator for the final layout.", modalImages: [{name: "image1", image: "../images/ghana.jpg"}]},
    {name: "Food Photography", type:"Photo", image : "../images/portfolio_page/food_square.jpg", description: "I like to take pictures of food at various restaurants. The biggest challenge is getting a nice bokeh shot (blurred background) while being inconspicuous. I shoot these with my Nikon D3300. Anyone can download these for free on my class project website: http://colettefleury.com/usabilityfinalproject/index.html.", modalImages: [{name: "image1", image: "../images/food_1.jpg"}, {name: "image2", image: "../images/food_2.jpg"}, {name: "image3", image: "../images/food_3.jpg"}]},
    {name: "Starz Talent Assets", type:"Social", image : "../images/portfolio_page/starztalent_square.jpg", description: "As an intern at Starz Entertainment, I created talent assets for online viewing. This task involved image placement, photo editing, and typography layout.", modalImages: [{name: "image1", image: "../images/small_neturi.jpg"}, {name: "image2", image: "../images/smalljoeshmoe.jpg"}, {name: "image3", image: "../images/assetsmall_omari.jpg"}, {name: "image4", image: "../images/sr_talentasset_comp.jpg"}]},
    {name: "Starz Program Social Advertising", type:"Social", image : "../images/portfolio_page/starzsocial_square.jpg", description: "As an intern at Starz Entertainment, I created show and film advertisements for Facebook, requiring key art positioning, brand adhesion, and minor image editing.", modalImages: [{name: "image1", image: "../images/social_ad.jpg"}]},
    {name: "Starz Gifs", type:"Social", image : "../images/portfolio_page/starzgif_square.jpg", description: "As an intern at Starz Entertainment, I created several GIFs by cutting show footage, ramping up contrast and brightness, and saving at web-acceptable sizes.", modalImages: [{name: "image1", image: "../images/015.gif"}, {name: "image2", image: "../images/016.gif"}]},
    {name: "Starz Microsites", type:"Web", image : "../images/portfolio_page/microsite_square.jpg", description: "As an intern at Starz Entertainment, I worked on \"Media Room\" (created in order for affiliates to learn more about shows) micro site design and development. This process involved image editing, type color input, brand adhesion and HTML development.", modalImages: [{name: "image1", image: "../images/micro_site.jpg"}]}
  ],
  posts: [
    {name: "High Chroma, Low Chroma: Effective Gradient Color Trends", type:"Web", image : "../images/portfolioitem.jpg", paragraphs: [{ name: "paragraph1", paragraph: "A recent popular phenomena in the sphere of digital design involves the use of striking color combinations invoked not with complementary colors, but with gradients composed of one high chroma (highly saturated), and one low chroma (white or black added) version of the same color. Variations tend to arise in slight hue changes in the two colors, often achieving a neon-like contrast emphasized in the lighter of the two."}, {name: "paragraph2", paragraph: "The strategy can be used in combination with larger color schemes incorporated into the larger whole of the imagery or interface, such as complimentary or split-complementary."}, {name: "paragraph3", paragraph: "The neon-like brightness achieved with this technique tends to illuminate otherwise stereotypically dull shape-based digital work. While overuse of the technique may reduce its eye-catching effects, the heavy contrast that is very hard to replicate in traditional art, or even perceive in reality short of sunsets, gives artwork and design an immediately noticeable look."}, {name: "paragraph4", paragraph: "I tend to notice this style a lot on small tech company websites, educational YouTube videos, and in much digital illustration. I love that it's currently vogue because it's real eye candy for me, but I do worry its overuse can lead it to fall out of favor in the same cyclical manner as handwritten and DIY-style design (which always comes and goes). Nevertheless, it's always interesting to see how the memetic trends change in the art and design world across time."}], modalImages: [{name: "image1", image: "../images/fleury_greeting.gif"}]},
    {name: "How this site was created", type:"Web", image : "../images/portfolioitem.jpg", paragraphs: [{ name: "paragraph1", paragraph: "The intersection of design and development in the form of interactivity is a beautiful thing. Not only does the designer have to consider visual appeal and comprehension as in static, 2D works, they have to plan how the visuals change, how the layout is structured, what elements of that layout remain static, what the user can do with the application that will alter the display in any way. Ultimately, will it make sense to the user and be easy to use?"}, {name: "paragraph2", paragraph: "When I designed this site, I did so with scalability and usability in mind. Could I add or remove projects easily? Integrate interactivity on mobile devices?"}, {name: "paragraph3", paragraph: "In order to create a vertasile application, I turned to Facebook's React.js library. This entire site is a single page application housed in one compiled JavaScript file, believe it on not. Why in the world did I do this, you might ask? Well, partly because I just wanted to learn how to do it. Yeah, really. The biggest benefit of using the library, though, is being able to house all data file references in one giant JavaScript object. So instead of having to go to separate pages, or even separate sections of a document, to update my projects, writings, video, and about page, I only need to look in one place. It's awesome."}, {name: "paragraph4", paragraph: "React.js is also well known for its ability to handle a page's state based on user-initiated events. In other words, if you click on the mobile menu of the site on a small device, react decides what happens on the screen through use of components, or special JavaScript classes meant to represent specific page parts, such as the main menu or project list. Rather than targeting specific DOM elements at random with vanilla JS or jQuery (which I did actually use for dynamic logo resizing), React makes sure the component changes occur in one neat little place. I'm still a React.js newbie, but I'm excited to see how much more easily I can create user interactivity by playing more with the library."}], modalImages: [{name: "image1", image: "../images/wireframes.jpg"}]},
    {name: "Banding: How to remove the worst of it", type:"Photo", image : "../images/portfolioitem.jpg", paragraphs: [{ name: "paragraph1", paragraph: "While playing around with subtle gradient effects for a class project, my work was plagued by horrific banding that was ridiculously noticeable even when saved out as a JPG. After searching around a bit to try and fix the issue, I came across this awesome post that describes a few different methods for reducing or even eliminating banding: <a href=\'http://nomorebanding.com/cache\'>http://nomorebanding.com/cache\</a>."}, {name: "paragraph2", paragraph: "My favorite method was using noise to produce randomization. Using the information in this post, I created a gradient in 16-bit mode, placed a new 50% gray layer over it in linear light blending mode, added noise twice to this layer, and merged the two layers for export. Since the post is a cached version and no longer shows any images, I figured I'd share my comparative results. The level of transparency should be approximately inversely proportional to the number of possible color steps in each channel in the desired color mode (1/256 for 8-bit). However, using the linear light mode messes with opacity settings, so using even less opacity is recommended. The goal is to produce enough randomization to smooth out the bands, but maintain enough transparency so that the noise isn't noticeable to the human eye. In 16-bit mode, I used an opacity of 2% and a fill of 20% on the noise layer with pretty drastic improvements."}], modalImages: [{name: "image1", image: "../images/compare.jpg"}]}
  ],
  about: [
	{paragraph: "You guessed it. My name is Colette! I like to think small and dream big by considering emergent processes in design. What does this mean? To plan and iterate while exploring both the small details and the bigger picture. After all, like Checkhov’s Gun, the small stuff is what makes the big picture all the more fascinating.", name: 'paragraph1'},
    {paragraph: "I was always described as artistic in grade school, and my love of the arts, as well as my interest in computer science and business, led me to explore a career in graphic design. From 2011 to 2014, I attended the University of Wyoming and received a Bachelors of Arts in Honors and Art with a graphic design emphasis. While in college, I developed my abilities in photography, printmaking, and drawing, which furthered my understanding of the art and design world as a whole. I also worked as a graphic and web designer for the Wyoming Union, designing dozens of posters and additional promotional material for community events on campus, and as a 3D modeling intern for the School of Energy Resources, creating virtual objects and buildings to display in a three dimensional rendering of campus.", name: 'paragraph2' },
    {paragraph: "After graduating, I contracted as a web design intern, production artist, and web designer in Denver and Boulder for School Datebooks, MDC Holdings, Metzger Albee Public Relations, and Starz Entertainment. I am currently pursuing a Master of Science in Information and Communications Technology with a Web Design and Development emphasis through the University of Denver's University College program.", name: 'paragraph3'
}
  ],
  home: [
	 {video: '../video/Comp1_1.mp4', image: '../images/bg.jpg' }
  ]
}